Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/sdramc.h
/* -------- SDRAMC_IER : (SDRAMC Offset: 0x14) ( /W 32) Interrupt Enable Register -------- */
#define SDRAMC_IER_RES_Pos                    _U_(0)                                               /**< (SDRAMC_IER) Refresh Error Interrupt Enable Position */
#define SDRAMC_IER_RES_Msk                    (_U_(0x1) << SDRAMC_IER_RES_Pos)                     /**< (SDRAMC_IER) Refresh Error Interrupt Enable Mask */
#define SDRAMC_IER_RES(value)                 (SDRAMC_IER_RES_Msk & ((value) << SDRAMC_IER_RES_Pos))
#define SDRAMC_IER_SECE_Pos                   _U_(1)                                               /**< (SDRAMC_IER) Security and/or Safety Event Interrupt Enable Position */
#define SDRAMC_IER_SECE_Msk                   (_U_(0x1) << SDRAMC_IER_SECE_Pos)                    /**< (SDRAMC_IER) Security and/or Safety Event Interrupt Enable Mask */
#define SDRAMC_IER_SECE(value)                (SDRAMC_IER_SECE_Msk & ((value) << SDRAMC_IER_SECE_Pos))
#define SDRAMC_IER_Msk                        _U_(0x00000003)                                      /**< (SDRAMC_IER) Register Mask  */


/* -------- SDRAMC_IDR : (SDRAMC Offset: 0x18) ( /W 32) Interrupt Disable Register -------- */
#define SDRAMC_IDR_RES_Pos                    _U_(0)                                               /**< (SDRAMC_IDR) Refresh Error Interrupt Disable Position */
#define SDRAMC_IDR_RES_Msk                    (_U_(0x1) << SDRAMC_IDR_RES_Pos)                     /**< (SDRAMC_IDR) Refresh Error Interrupt Disable Mask */
#define SDRAMC_IDR_RES(value)                 (SDRAMC_IDR_RES_Msk & ((value) << SDRAMC_IDR_RES_Pos))
#define SDRAMC_IDR_SECE_Pos                   _U_(1)                                               /**< (SDRAMC_IDR) Security and/or Safety Event Interrupt Disable Position */
#define SDRAMC_IDR_SECE_Msk                   (_U_(0x1) << SDRAMC_IDR_SECE_Pos)                    /**< (SDRAMC_IDR) Security and/or Safety Event Interrupt Disable Mask */
#define SDRAMC_IDR_SECE(value)                (SDRAMC_IDR_SECE_Msk & ((value) << SDRAMC_IDR_SECE_Pos))
#define SDRAMC_IDR_Msk                        _U_(0x00000003)                                      /**< (SDRAMC_IDR) Register Mask  */


/* -------- SDRAMC_IMR : (SDRAMC Offset: 0x1C) ( R/ 32) Interrupt Mask Register -------- */
#define SDRAMC_IMR_RES_Pos                    _U_(0)                                               /**< (SDRAMC_IMR) Refresh Error Interrupt Mask Position */
#define SDRAMC_IMR_RES_Msk                    (_U_(0x1) << SDRAMC_IMR_RES_Pos)                     /**< (SDRAMC_IMR) Refresh Error Interrupt Mask Mask */
#define SDRAMC_IMR_RES(value)                 (SDRAMC_IMR_RES_Msk & ((value) << SDRAMC_IMR_RES_Pos))
#define SDRAMC_IMR_SECE_Pos                   _U_(1)                                               /**< (SDRAMC_IMR) Security and/or Safety Event Interrupt Mask Position */
#define SDRAMC_IMR_SECE_Msk                   (_U_(0x1) << SDRAMC_IMR_SECE_Pos)                    /**< (SDRAMC_IMR) Security and/or Safety Event Interrupt Mask Mask */
#define SDRAMC_IMR_SECE(value)                (SDRAMC_IMR_SECE_Msk & ((value) << SDRAMC_IMR_SECE_Pos))
#define SDRAMC_IMR_Msk                        _U_(0x00000003)                                      /**< (SDRAMC_IMR) Register Mask  */


/* -------- SDRAMC_ISR : (SDRAMC Offset: 0x20) ( R/ 32) Interrupt Status Register -------- */
#define SDRAMC_ISR_RES_Pos                    _U_(0)                                               /**< (SDRAMC_ISR) Refresh Error Status (cleared on read) Position */
#define SDRAMC_ISR_RES_Msk                    (_U_(0x1) << SDRAMC_ISR_RES_Pos)                     /**< (SDRAMC_ISR) Refresh Error Status (cleared on read) Mask */
#define SDRAMC_ISR_RES(value)                 (SDRAMC_ISR_RES_Msk & ((value) << SDRAMC_ISR_RES_Pos))
#define SDRAMC_ISR_SECE_Pos                   _U_(1)                                               /**< (SDRAMC_ISR) Security and/or Safety Event (cleared on read) Position */
#define SDRAMC_ISR_SECE_Msk                   (_U_(0x1) << SDRAMC_ISR_SECE_Pos)                    /**< (SDRAMC_ISR) Security and/or Safety Event (cleared on read) Mask */
#define SDRAMC_ISR_SECE(value)                (SDRAMC_ISR_SECE_Msk & ((value) << SDRAMC_ISR_SECE_Pos))
#define SDRAMC_ISR_Msk                        _U_(0x00000003)                                      /**< (SDRAMC_ISR) Register Mask  */


/* -------- SDRAMC_MDR : (SDRAMC Offset: 0x24) (R/W 32) Memory Device Register -------- */
#define SDRAMC_MDR_MD_Pos                     _U_(0)                                               /**< (SDRAMC_MDR) Memory Device Type Position */
#define SDRAMC_MDR_MD_Msk                     (_U_(0x3) << SDRAMC_MDR_MD_Pos)                      /**< (SDRAMC_MDR) Memory Device Type Mask */
#define SDRAMC_MDR_MD(value)                  (SDRAMC_MDR_MD_Msk & ((value) << SDRAMC_MDR_MD_Pos))
#define   SDRAMC_MDR_MD_SDRAM_Val             _U_(0x0)                                             /**< (SDRAMC_MDR) SDRAM  */
#define   SDRAMC_MDR_MD_LPSDRAM_Val           _U_(0x1)                                             /**< (SDRAMC_MDR) Low-power SDRAM  */
#define SDRAMC_MDR_MD_SDRAM                   (SDRAMC_MDR_MD_SDRAM_Val << SDRAMC_MDR_MD_Pos)       /**< (SDRAMC_MDR) SDRAM Position  */
#define SDRAMC_MDR_MD_LPSDRAM                 (SDRAMC_MDR_MD_LPSDRAM_Val << SDRAMC_MDR_MD_Pos)     /**< (SDRAMC_MDR) Low-power SDRAM Position  */
#define SDRAMC_MDR_SHIFT_SAMPLING_Pos         _U_(4)                                               /**< (SDRAMC_MDR) Shift Sampling Point of Data Position */
#define SDRAMC_MDR_SHIFT_SAMPLING_Msk         (_U_(0x3) << SDRAMC_MDR_SHIFT_SAMPLING_Pos)          /**< (SDRAMC_MDR) Shift Sampling Point of Data Mask */
#define SDRAMC_MDR_SHIFT_SAMPLING(value)      (SDRAMC_MDR_SHIFT_SAMPLING_Msk & ((value) << SDRAMC_MDR_SHIFT_SAMPLING_Pos))
#define   SDRAMC_MDR_SHIFT_SAMPLING_SHIFT_ONE_CYCLE_Val _U_(0x1)                                             /**< (SDRAMC_MDR) Sampling point is shifted by one cycle.  */
#define   SDRAMC_MDR_SHIFT_SAMPLING_SHIFT_TWO_CYCLES_Val _U_(0x2)                                             /**< (SDRAMC_MDR) Sampling point is shifted by two cycles.  */
#define   SDRAMC_MDR_SHIFT_SAMPLING_SHIFT_THREE_CYCLES_Val _U_(0x3)                                             /**< (SDRAMC_MDR) Sampling point is shifted by three cycles.  */
#define SDRAMC_MDR_SHIFT_SAMPLING_SHIFT_ONE_CYCLE (SDRAMC_MDR_SHIFT_SAMPLING_SHIFT_ONE_CYCLE_Val << SDRAMC_MDR_SHIFT_SAMPLING_Pos) /**< (SDRAMC_MDR) Sampling point is shifted by one cycle. Position  */
#define SDRAMC_MDR_SHIFT_SAMPLING_SHIFT_TWO_CYCLES (SDRAMC_MDR_SHIFT_SAMPLING_SHIFT_TWO_CYCLES_Val << SDRAMC_MDR_SHIFT_SAMPLING_Pos) /**< (SDRAMC_MDR) Sampling point is shifted by two cycles. Position  */
#define SDRAMC_MDR_SHIFT_SAMPLING_SHIFT_THREE_CYCLES (SDRAMC_MDR_SHIFT_SAMPLING_SHIFT_THREE_CYCLES_Val << SDRAMC_MDR_SHIFT_SAMPLING_Pos) /**< (SDRAMC_MDR) Sampling point is shifted by three cycles. Position  */
#define SDRAMC_MDR_Msk                        _U_(0x00000033)                                      /**< (SDRAMC_MDR) Register Mask  */


/* -------- SDRAMC_CFR1 : (SDRAMC Offset: 0x28) (R/W 32) Configuration Register 1 -------- */
#define SDRAMC_CFR1_TMRD_Pos                  _U_(0)                                               /**< (SDRAMC_CFR1) Load Mode Register Command to Active or Refresh Command Position */
#define SDRAMC_CFR1_TMRD_Msk                  (_U_(0xF) << SDRAMC_CFR1_TMRD_Pos)                   /**< (SDRAMC_CFR1) Load Mode Register Command to Active or Refresh Command Mask */
#define SDRAMC_CFR1_TMRD(value)               (SDRAMC_CFR1_TMRD_Msk & ((value) << SDRAMC_CFR1_TMRD_Pos))
#define SDRAMC_CFR1_UNAL_Pos                  _U_(8)                                               /**< (SDRAMC_CFR1) This bit must be always written to 1 Position */
#define SDRAMC_CFR1_UNAL_Msk                  (_U_(0x1) << SDRAMC_CFR1_UNAL_Pos)                   /**< (SDRAMC_CFR1) This bit must be always written to 1 Mask */
#define SDRAMC_CFR1_UNAL(value)               (SDRAMC_CFR1_UNAL_Msk & ((value) << SDRAMC_CFR1_UNAL_Pos))
#define SDRAMC_CFR1_ADD_DATA_MUX_Pos          _U_(10)                                              /**< (SDRAMC_CFR1) Multiplexed Address and Data Position */
#define SDRAMC_CFR1_ADD_DATA_MUX_Msk          (_U_(0x1) << SDRAMC_CFR1_ADD_DATA_MUX_Pos)           /**< (SDRAMC_CFR1) Multiplexed Address and Data Mask */
#define SDRAMC_CFR1_ADD_DATA_MUX(value)       (SDRAMC_CFR1_ADD_DATA_MUX_Msk & ((value) << SDRAMC_CFR1_ADD_DATA_MUX_Pos))
#define   SDRAMC_CFR1_ADD_DATA_MUX_UNSUPPORTED_Val _U_(0x0)                                             /**< (SDRAMC_CFR1) Data and address are not multiplexed  */
#define   SDRAMC_CFR1_ADD_DATA_MUX_SUPPORTED_Val _U_(0x1)                                             /**< (SDRAMC_CFR1) Data and address are multiplexed  */
#define SDRAMC_CFR1_ADD_DATA_MUX_UNSUPPORTED  (SDRAMC_CFR1_ADD_DATA_MUX_UNSUPPORTED_Val << SDRAMC_CFR1_ADD_DATA_MUX_Pos) /**< (SDRAMC_CFR1) Data and address are not multiplexed Position  */
#define SDRAMC_CFR1_ADD_DATA_MUX_SUPPORTED    (SDRAMC_CFR1_ADD_DATA_MUX_SUPPORTED_Val << SDRAMC_CFR1_ADD_DATA_MUX_Pos) /**< (SDRAMC_CFR1) Data and address are multiplexed Position  */
#define SDRAMC_CFR1_CMD_MUX_Pos               _U_(11)                                              /**< (SDRAMC_CFR1) Commands are Multiplexed with Address and Data Position */
#define SDRAMC_CFR1_CMD_MUX_Msk               (_U_(0x1) << SDRAMC_CFR1_CMD_MUX_Pos)                /**< (SDRAMC_CFR1) Commands are Multiplexed with Address and Data Mask */
#define SDRAMC_CFR1_CMD_MUX(value)            (SDRAMC_CFR1_CMD_MUX_Msk & ((value) << SDRAMC_CFR1_CMD_MUX_Pos))
#define   SDRAMC_CFR1_CMD_MUX_UNSUPPORTED_Val _U_(0x0)                                             /**< (SDRAMC_CFR1) Commands are not multiplexed with address and data.  */
#define   SDRAMC_CFR1_CMD_MUX_SUPPORTED_Val   _U_(0x1)                                             /**< (SDRAMC_CFR1) Commands are multiplexed with address and data.  */
#define SDRAMC_CFR1_CMD_MUX_UNSUPPORTED       (SDRAMC_CFR1_CMD_MUX_UNSUPPORTED_Val << SDRAMC_CFR1_CMD_MUX_Pos) /**< (SDRAMC_CFR1) Commands are not multiplexed with address and data. Position  */
#define SDRAMC_CFR1_CMD_MUX_SUPPORTED         (SDRAMC_CFR1_CMD_MUX_SUPPORTED_Val << SDRAMC_CFR1_CMD_MUX_Pos) /**< (SDRAMC_CFR1) Commands are multiplexed with address and data. Position  */
#define SDRAMC_CFR1_Msk                       _U_(0x00000D0F)                                      /**< (SDRAMC_CFR1) Register Mask  */


/* -------- SDRAMC_OCMS : (SDRAMC Offset: 0x2C) (R/W 32) OCMS Register -------- */
#define SDRAMC_OCMS_SDR_SE_Pos                _U_(0)                                               /**< (SDRAMC_OCMS) SDRAM Memory Controller Scrambling Enable Position */
#define SDRAMC_OCMS_SDR_SE_Msk                (_U_(0x1) << SDRAMC_OCMS_SDR_SE_Pos)                 /**< (SDRAMC_OCMS) SDRAM Memory Controller Scrambling Enable Mask */
#define SDRAMC_OCMS_SDR_SE(value)             (SDRAMC_OCMS_SDR_SE_Msk & ((value) << SDRAMC_OCMS_SDR_SE_Pos))
#define SDRAMC_OCMS_Msk                       _U_(0x00000001)                                      /**< (SDRAMC_OCMS) Register Mask  */


