Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/sdramc.h
/* -------- SDRAMC_OCMS_KEY1 : (SDRAMC Offset: 0x30) ( /W 32) OCMS KEY1 Register -------- */
#define SDRAMC_OCMS_KEY1_KEY1_Pos             _U_(0)                                               /**< (SDRAMC_OCMS_KEY1) Off-chip Memory Scrambling (OCMS) Key Part 1 Position */
#define SDRAMC_OCMS_KEY1_KEY1_Msk             (_U_(0xFFFFFFFF) << SDRAMC_OCMS_KEY1_KEY1_Pos)       /**< (SDRAMC_OCMS_KEY1) Off-chip Memory Scrambling (OCMS) Key Part 1 Mask */
#define SDRAMC_OCMS_KEY1_KEY1(value)          (SDRAMC_OCMS_KEY1_KEY1_Msk & ((value) << SDRAMC_OCMS_KEY1_KEY1_Pos))
#define SDRAMC_OCMS_KEY1_Msk                  _U_(0xFFFFFFFF)                                      /**< (SDRAMC_OCMS_KEY1) Register Mask  */


/* -------- SDRAMC_OCMS_KEY2 : (SDRAMC Offset: 0x34) ( /W 32) OCMS KEY2 Register -------- */
#define SDRAMC_OCMS_KEY2_KEY2_Pos             _U_(0)                                               /**< (SDRAMC_OCMS_KEY2) Off-chip Memory Scrambling (OCMS) Key Part 2 Position */
#define SDRAMC_OCMS_KEY2_KEY2_Msk             (_U_(0xFFFFFFFF) << SDRAMC_OCMS_KEY2_KEY2_Pos)       /**< (SDRAMC_OCMS_KEY2) Off-chip Memory Scrambling (OCMS) Key Part 2 Mask */
#define SDRAMC_OCMS_KEY2_KEY2(value)          (SDRAMC_OCMS_KEY2_KEY2_Msk & ((value) << SDRAMC_OCMS_KEY2_KEY2_Pos))
#define SDRAMC_OCMS_KEY2_Msk                  _U_(0xFFFFFFFF)                                      /**< (SDRAMC_OCMS_KEY2) Register Mask  */


/* -------- SDRAMC_WPMR : (SDRAMC Offset: 0x3C) (R/W 32) Write Protection Mode Register -------- */
#define SDRAMC_WPMR_WPEN_Pos                  _U_(0)                                               /**< (SDRAMC_WPMR) Write Protection Enable Position */
#define SDRAMC_WPMR_WPEN_Msk                  (_U_(0x1) << SDRAMC_WPMR_WPEN_Pos)                   /**< (SDRAMC_WPMR) Write Protection Enable Mask */
#define SDRAMC_WPMR_WPEN(value)               (SDRAMC_WPMR_WPEN_Msk & ((value) << SDRAMC_WPMR_WPEN_Pos))
#define SDRAMC_WPMR_WPITEN_Pos                _U_(1)                                               /**< (SDRAMC_WPMR) Write Protection Interrupt Enable Position */
#define SDRAMC_WPMR_WPITEN_Msk                (_U_(0x1) << SDRAMC_WPMR_WPITEN_Pos)                 /**< (SDRAMC_WPMR) Write Protection Interrupt Enable Mask */
#define SDRAMC_WPMR_WPITEN(value)             (SDRAMC_WPMR_WPITEN_Msk & ((value) << SDRAMC_WPMR_WPITEN_Pos))
#define SDRAMC_WPMR_WPKEY_Pos                 _U_(8)                                               /**< (SDRAMC_WPMR) Write Protection Key Position */
#define SDRAMC_WPMR_WPKEY_Msk                 (_U_(0xFFFFFF) << SDRAMC_WPMR_WPKEY_Pos)             /**< (SDRAMC_WPMR) Write Protection Key Mask */
#define SDRAMC_WPMR_WPKEY(value)              (SDRAMC_WPMR_WPKEY_Msk & ((value) << SDRAMC_WPMR_WPKEY_Pos))
#define   SDRAMC_WPMR_WPKEY_PASSWD_Val        _U_(0x534452)                                        /**< (SDRAMC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.  */
#define SDRAMC_WPMR_WPKEY_PASSWD              (SDRAMC_WPMR_WPKEY_PASSWD_Val << SDRAMC_WPMR_WPKEY_Pos) /**< (SDRAMC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. Position  */
#define SDRAMC_WPMR_Msk                       _U_(0xFFFFFF03)                                      /**< (SDRAMC_WPMR) Register Mask  */


/* -------- SDRAMC_WPSR : (SDRAMC Offset: 0x40) ( R/ 32) Write Protection Status Register -------- */
#define SDRAMC_WPSR_WPEN_Pos                  _U_(0)                                               /**< (SDRAMC_WPSR) Write Protection Violation Status (cleared on read) Position */
#define SDRAMC_WPSR_WPEN_Msk                  (_U_(0x1) << SDRAMC_WPSR_WPEN_Pos)                   /**< (SDRAMC_WPSR) Write Protection Violation Status (cleared on read) Mask */
#define SDRAMC_WPSR_WPEN(value)               (SDRAMC_WPSR_WPEN_Msk & ((value) << SDRAMC_WPSR_WPEN_Pos))
#define SDRAMC_WPSR_CGD_Pos                   _U_(1)                                               /**< (SDRAMC_WPSR) Clock Glitch Detected (cleared on read) Position */
#define SDRAMC_WPSR_CGD_Msk                   (_U_(0x1) << SDRAMC_WPSR_CGD_Pos)                    /**< (SDRAMC_WPSR) Clock Glitch Detected (cleared on read) Mask */
#define SDRAMC_WPSR_CGD(value)                (SDRAMC_WPSR_CGD_Msk & ((value) << SDRAMC_WPSR_CGD_Pos))
#define SDRAMC_WPSR_SEQE_Pos                  _U_(2)                                               /**< (SDRAMC_WPSR) Internal Sequencer Error (cleared on read) Position */
#define SDRAMC_WPSR_SEQE_Msk                  (_U_(0x1) << SDRAMC_WPSR_SEQE_Pos)                   /**< (SDRAMC_WPSR) Internal Sequencer Error (cleared on read) Mask */
#define SDRAMC_WPSR_SEQE(value)               (SDRAMC_WPSR_SEQE_Msk & ((value) << SDRAMC_WPSR_SEQE_Pos))
#define SDRAMC_WPSR_SWE_Pos                   _U_(3)                                               /**< (SDRAMC_WPSR) Software Control Error (cleared on read) Position */
#define SDRAMC_WPSR_SWE_Msk                   (_U_(0x1) << SDRAMC_WPSR_SWE_Pos)                    /**< (SDRAMC_WPSR) Software Control Error (cleared on read) Mask */
#define SDRAMC_WPSR_SWE(value)                (SDRAMC_WPSR_SWE_Msk & ((value) << SDRAMC_WPSR_SWE_Pos))
#define SDRAMC_WPSR_WPVSRC_Pos                _U_(8)                                               /**< (SDRAMC_WPSR) Write Protection Violation Source Position */
#define SDRAMC_WPSR_WPVSRC_Msk                (_U_(0xFF) << SDRAMC_WPSR_WPVSRC_Pos)                /**< (SDRAMC_WPSR) Write Protection Violation Source Mask */
#define SDRAMC_WPSR_WPVSRC(value)             (SDRAMC_WPSR_WPVSRC_Msk & ((value) << SDRAMC_WPSR_WPVSRC_Pos))
#define SDRAMC_WPSR_SWETYP_Pos                _U_(24)                                              /**< (SDRAMC_WPSR) Software Error Type (cleared on read) Position */
#define SDRAMC_WPSR_SWETYP_Msk                (_U_(0x7) << SDRAMC_WPSR_SWETYP_Pos)                 /**< (SDRAMC_WPSR) Software Error Type (cleared on read) Mask */
#define SDRAMC_WPSR_SWETYP(value)             (SDRAMC_WPSR_SWETYP_Msk & ((value) << SDRAMC_WPSR_SWETYP_Pos))
#define   SDRAMC_WPSR_SWETYP_READ_WO_Val      _U_(0x0)                                             /**< (SDRAMC_WPSR) A write-only register has been read (Warning).  */
#define   SDRAMC_WPSR_SWETYP_WRITE_RO_Val     _U_(0x1)                                             /**< (SDRAMC_WPSR) A write access has been performed on a read-only register (Warning).  */
#define   SDRAMC_WPSR_SWETYP_UNDEF_RW_Val     _U_(0x2)                                             /**< (SDRAMC_WPSR) Access to an undefined address (Warning).  */
#define   SDRAMC_WPSR_SWETYP_W_AFTER_INIT_Val _U_(0x3)                                             /**< (SDRAMC_WPSR) Write access performed into some configuration registers after memory device initialization, i.e. if SDRAMC_TR.COUNT > 0 (Error).  */
#define SDRAMC_WPSR_SWETYP_READ_WO            (SDRAMC_WPSR_SWETYP_READ_WO_Val << SDRAMC_WPSR_SWETYP_Pos) /**< (SDRAMC_WPSR) A write-only register has been read (Warning). Position  */
#define SDRAMC_WPSR_SWETYP_WRITE_RO           (SDRAMC_WPSR_SWETYP_WRITE_RO_Val << SDRAMC_WPSR_SWETYP_Pos) /**< (SDRAMC_WPSR) A write access has been performed on a read-only register (Warning). Position  */
#define SDRAMC_WPSR_SWETYP_UNDEF_RW           (SDRAMC_WPSR_SWETYP_UNDEF_RW_Val << SDRAMC_WPSR_SWETYP_Pos) /**< (SDRAMC_WPSR) Access to an undefined address (Warning). Position  */
#define SDRAMC_WPSR_SWETYP_W_AFTER_INIT       (SDRAMC_WPSR_SWETYP_W_AFTER_INIT_Val << SDRAMC_WPSR_SWETYP_Pos) /**< (SDRAMC_WPSR) Write access performed into some configuration registers after memory device initialization, i.e. if SDRAMC_TR.COUNT > 0 (Error). Position  */
#define SDRAMC_WPSR_ECLASS_Pos                _U_(31)                                              /**< (SDRAMC_WPSR) Software Error Class (cleared on read) Position */
#define SDRAMC_WPSR_ECLASS_Msk                (_U_(0x1) << SDRAMC_WPSR_ECLASS_Pos)                 /**< (SDRAMC_WPSR) Software Error Class (cleared on read) Mask */
#define SDRAMC_WPSR_ECLASS(value)             (SDRAMC_WPSR_ECLASS_Msk & ((value) << SDRAMC_WPSR_ECLASS_Pos))
#define   SDRAMC_WPSR_ECLASS_WARNING_Val      _U_(0x0)                                             /**< (SDRAMC_WPSR) An abnormal access is performed but it does not affect system functionality.  */
#define   SDRAMC_WPSR_ECLASS_ERROR_Val        _U_(0x1)                                             /**< (SDRAMC_WPSR) An access is performed into some registers after memory device initialization sequence.  */
#define SDRAMC_WPSR_ECLASS_WARNING            (SDRAMC_WPSR_ECLASS_WARNING_Val << SDRAMC_WPSR_ECLASS_Pos) /**< (SDRAMC_WPSR) An abnormal access is performed but it does not affect system functionality. Position  */
#define SDRAMC_WPSR_ECLASS_ERROR              (SDRAMC_WPSR_ECLASS_ERROR_Val << SDRAMC_WPSR_ECLASS_Pos) /**< (SDRAMC_WPSR) An access is performed into some registers after memory device initialization sequence. Position  */
#define SDRAMC_WPSR_Msk                       _U_(0x8700FF0F)                                      /**< (SDRAMC_WPSR) Register Mask  */


/* -------- SDRAMC_VERSION : (SDRAMC Offset: 0xFC) ( R/ 32) Version Register -------- */
#define SDRAMC_VERSION_VERSION_Pos            _U_(0)                                               /**< (SDRAMC_VERSION) Version of the Hardware Module Position */
#define SDRAMC_VERSION_VERSION_Msk            (_U_(0xFFF) << SDRAMC_VERSION_VERSION_Pos)           /**< (SDRAMC_VERSION) Version of the Hardware Module Mask */
#define SDRAMC_VERSION_VERSION(value)         (SDRAMC_VERSION_VERSION_Msk & ((value) << SDRAMC_VERSION_VERSION_Pos))
#define SDRAMC_VERSION_MFN_Pos                _U_(16)                                              /**< (SDRAMC_VERSION) Metal Fix Number Position */
#define SDRAMC_VERSION_MFN_Msk                (_U_(0x7) << SDRAMC_VERSION_MFN_Pos)                 /**< (SDRAMC_VERSION) Metal Fix Number Mask */
#define SDRAMC_VERSION_MFN(value)             (SDRAMC_VERSION_MFN_Msk & ((value) << SDRAMC_VERSION_MFN_Pos))
#define SDRAMC_VERSION_Msk                    _U_(0x00070FFF)                                      /**< (SDRAMC_VERSION) Register Mask  */


/** \brief SDRAMC register offsets definitions */
#define SDRAMC_MR_REG_OFST             (0x00)              /**< (SDRAMC_MR) Mode Register Offset */
#define SDRAMC_TR_REG_OFST             (0x04)              /**< (SDRAMC_TR) Refresh Timer Register Offset */
#define SDRAMC_CR_REG_OFST             (0x08)              /**< (SDRAMC_CR) Configuration Register Offset */
#define SDRAMC_HSR_REG_OFST            (0x0C)              /**< (SDRAMC_HSR) High-Speed Register Offset */
#define SDRAMC_LPR_REG_OFST            (0x10)              /**< (SDRAMC_LPR) Low-Power Register Offset */
#define SDRAMC_IER_REG_OFST            (0x14)              /**< (SDRAMC_IER) Interrupt Enable Register Offset */
#define SDRAMC_IDR_REG_OFST            (0x18)              /**< (SDRAMC_IDR) Interrupt Disable Register Offset */
#define SDRAMC_IMR_REG_OFST            (0x1C)              /**< (SDRAMC_IMR) Interrupt Mask Register Offset */
#define SDRAMC_ISR_REG_OFST            (0x20)              /**< (SDRAMC_ISR) Interrupt Status Register Offset */
#define SDRAMC_MDR_REG_OFST            (0x24)              /**< (SDRAMC_MDR) Memory Device Register Offset */
#define SDRAMC_CFR1_REG_OFST           (0x28)              /**< (SDRAMC_CFR1) Configuration Register 1 Offset */
#define SDRAMC_OCMS_REG_OFST           (0x2C)              /**< (SDRAMC_OCMS) OCMS Register Offset */
#define SDRAMC_OCMS_KEY1_REG_OFST      (0x30)              /**< (SDRAMC_OCMS_KEY1) OCMS KEY1 Register Offset */
#define SDRAMC_OCMS_KEY2_REG_OFST      (0x34)              /**< (SDRAMC_OCMS_KEY2) OCMS KEY2 Register Offset */
#define SDRAMC_WPMR_REG_OFST           (0x3C)              /**< (SDRAMC_WPMR) Write Protection Mode Register Offset */
#define SDRAMC_WPSR_REG_OFST           (0x40)              /**< (SDRAMC_WPSR) Write Protection Status Register Offset */
#define SDRAMC_VERSION_REG_OFST        (0xFC)              /**< (SDRAMC_VERSION) Version Register Offset */

