Microchip-MPLAB-Harmony/csp/apps/pio/pio_led_on_off_polling/firmware/src/packs/ATSAM9X60_DFP/component/sdramc.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief SDRAMC register API structure */
typedef struct
{
  __IO  uint32_t                       SDRAMC_MR;          /**< Offset: 0x00 (R/W  32) Mode Register */
  __IO  uint32_t                       SDRAMC_TR;          /**< Offset: 0x04 (R/W  32) Refresh Timer Register */
  __IO  uint32_t                       SDRAMC_CR;          /**< Offset: 0x08 (R/W  32) Configuration Register */
  __IO  uint32_t                       SDRAMC_HSR;         /**< Offset: 0x0C (R/W  32) High-Speed Register */
  __IO  uint32_t                       SDRAMC_LPR;         /**< Offset: 0x10 (R/W  32) Low-Power Register */
  __O   uint32_t                       SDRAMC_IER;         /**< Offset: 0x14 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       SDRAMC_IDR;         /**< Offset: 0x18 ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       SDRAMC_IMR;         /**< Offset: 0x1C (R/   32) Interrupt Mask Register */
  __I   uint32_t                       SDRAMC_ISR;         /**< Offset: 0x20 (R/   32) Interrupt Status Register */
  __IO  uint32_t                       SDRAMC_MDR;         /**< Offset: 0x24 (R/W  32) Memory Device Register */
  __IO  uint32_t                       SDRAMC_CFR1;        /**< Offset: 0x28 (R/W  32) Configuration Register 1 */
  __IO  uint32_t                       SDRAMC_OCMS;        /**< Offset: 0x2C (R/W  32) OCMS Register */
  __O   uint32_t                       SDRAMC_OCMS_KEY1;   /**< Offset: 0x30 ( /W  32) OCMS KEY1 Register */
  __O   uint32_t                       SDRAMC_OCMS_KEY2;   /**< Offset: 0x34 ( /W  32) OCMS KEY2 Register */
  __I   uint8_t                        Reserved1[0x04];
  __IO  uint32_t                       SDRAMC_WPMR;        /**< Offset: 0x3C (R/W  32) Write Protection Mode Register */
  __I   uint32_t                       SDRAMC_WPSR;        /**< Offset: 0x40 (R/   32) Write Protection Status Register */
  __I   uint8_t                        Reserved2[0xB8];
  __I   uint32_t                       SDRAMC_VERSION;     /**< Offset: 0xFC (R/   32) Version Register */
} sdramc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAM9X_SDRAMC_COMPONENT_H_ */
